Autodesk.Revit.DB.CameraInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.CameraInfo.UpOffset
Distance that the target plane is offset in the direction of
the Up direction. This offset shifts both top and bottom planes.
Since:
2014

Autodesk.Revit.DB.CameraInfo.RightOffset
Distance that the target plane is offset towards the right
where right is normal to both Up direction and View direction.
This offset shifts both left and right planes.
Since:
2014

Autodesk.Revit.DB.CameraInfo.TargetDistance
Distance from eye point along view direction to target plane.
Remarks:
This value is appropriate for perspective views only.
Attempts to get this value for an orthographic view can
be made, but the obtained value is to be ignored.
Since:
2014

Autodesk.Revit.DB.CameraInfo.NearDistance
Distance from eye point to near plane of view frustum along the view direction.
Remarks:
This property together with FarDistance determines the depth restrictions of a view frustum.
Since:
2014

Autodesk.Revit.DB.CameraInfo.FarDistance
Distance from eye point to far plane of view frustum along the view direction.
Remarks:
This property together with NearDistance determines the depth restrictions of a view frustum.
Since:
2014

Autodesk.Revit.DB.CameraInfo.HorizontalExtent
Distance between left and right planes on the target plane.
Since:
2014

Autodesk.Revit.DB.CameraInfo.VerticalExtent
Distance between top and bottom planes on the target plane.
Since:
2014

Autodesk.Revit.DB.CameraInfo.IsPerspective
Identifies whether the projection is orthographic or perspective
Since:
2016

Autodesk.Revit.DB.CameraInfo.IsPespective
Identifies whether the projection is orthographic or perspective
Since:
2014

Autodesk.Revit.DB.CameraInfo
An object holding information about the projection mapping of a 3D view.
Remarks:
CameraInfo can be obtained directly from a Autodesk.Revit.DB.ViewNode
If camera info is not available, an orthographic view should be assumed.
See also: Autodesk::Revit::DB::IExportContext::OnViewBegin.
Since:
2014